java-basics/00_introduccion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-17 Thu 09:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc17100">1. Introducción a Java</a>
<ul>
<li><a href="#orge71d741">1.1. ¿Qué es Java?</a></li>
<li><a href="#org7b1f641">1.2. ¿Qué es un lenguaje de programación?</a></li>
<li><a href="#org94a8598">1.3. ¿Qué es la <i>programación orientada a objetos</i>?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc17100" class="outline-2">
<h2 id="orgfc17100"><span class="section-number-2">1.</span> Introducción a Java</h2>
<div class="outline-text-2" id="text-1">
<p>
Antes de empezar a programar, es escencial entrar en contexto, ya que
esta información no se volverá a repetir por el resto de la guía (o el
resto de sus vidas).
</p>
</div>
<div id="outline-container-orge71d741" class="outline-3">
<h3 id="orge71d741"><span class="section-number-3">1.1.</span> ¿Qué es Java?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Java es un <b>lenguaje de programación</b> <i>orientado a objetos</i> reado en
1995 por <b>Oracle</b>. Es usado por más de 3,000,000,000 de dispositivos
como:
</p>

<ul class="org-ul">
<li>Teléfonos celulares (Android)</li>
<li>Aplicaciones Web (Linkedin, Aliexpress, blogspot..)</li>
<li>Aplicaciones de escritorio (Oficina, editores, navegadores web..)</li>
<li>Juegos (Minecraft JAVA edition por supuesto!)</li>
<li>Dispositivos electrónicos (impresoras, refrigeradores, pantallas..)</li>
</ul>

<p>
Y mucho más!
</p>

<p>
Así como del latín nació el español, <i>Java</i> fue creado e inspirado en
<i>C</i>, otro lenguaje de programación más antiguo; por lo que aprenderás
2 lenguajes al mismo tiempo! Además de que es seguro, eficiente, es
multiplataforma que quiere decir que se puede ejecutar en cualquier
sistema operativo gracias a la <b>JVM</b> (Java Virtual Machine).
</p>
</div>
</div>
<div id="outline-container-org7b1f641" class="outline-3">
<h3 id="org7b1f641"><span class="section-number-3">1.2.</span> ¿Qué es un lenguaje de programación?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Un lenguaje de programación es un <i>idioma</i> que nos permite
comunicarnos de una manera más fácil con la computadora; mientras más
fácil entendamos, más alto nivel.
</p>

<p>
Cualquier dispositivo electrónico, ya sea calculadora, microondas,
lavadora, computadora, televisión etc. opera mediante señales
eléctricas conocidas como <i>prendido</i> y <i>apagado</i>, o <code>1</code> y <code>0</code>
respectivamente, también llamados <b>bit</b>.
</p>

<p>
Una computadora no puede leer la información como nosotros lo
hacemos. Por ejemplo el siguiente texto de la derecha, la computadora
lee cada cáracter como un <b>byte</b> que es una mezcla de <i>8 bits</i>. Más
adelante profundizaremos en este tema de los <b>bytes</b>.
</p>

<div class="org-src-container">
<pre class="src src-bash">$ echo <span style="color: #deb887;">"Si lo puedes imaginar, lo puedes programar"</span> | hexdump -C
00000000  53 69 20 6c 6f 20 70 75  65 64 65 73 20 69 6d 61  |Si lo puedes ima|
00000010  67 69 6e 61 72 2c 20 6c  6f 20 70 75 65 64 65 73  |ginar, lo puedes|
00000020  20 70 72 6f 67 72 61 6d  61 72 0a                 | programar.|
</pre>
</div>


<p>
Como humanos es más fácil leer y escribir como humanos, o sea <span class="underline">letras
y símbolos</span> aunque siempre hay gente mazoquista que le gusta hablar
<b>bytes</b>. Así los lenguajes de programación nos ayudan a plasmar
nuestras ideas y algoritmos a números raros/ <i>bytes</i> que una computadora
entiende y hace rápido con una gran precisión.
</p>

<p>
<b>Nota</b>: Una idea errónea es que una computadora por hacer operaciones
de manera muy rápida implica que es <i>inteligente</i> lo cual es una obvia
equivocación ya que las computadoras solo siguen algoritmos y no
sienten.
</p>
</div>
</div>
<div id="outline-container-org94a8598" class="outline-3">
<h3 id="org94a8598"><span class="section-number-3">1.3.</span> ¿Qué es la <i>programación orientada a objetos</i>?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Este es un concepto que irá quedando más claro conforme vayas
avanzando en esta guía. Por lo mientras puedes imaginarlo como: meter
objetos de la vida real a una computadora como un avión, un gato, un
empleado, un carro etc.
</p>

<p>
Claramente no es posible meter 100 personas dentro de una computadora
(tal vez en los años 50 cuando las computadoras eran del tamaño de una
casa), pero podemos <i>transformar</i> estos objetos a <b>números</b>, <b>letras</b>
y <b>verdadero/falso</b> que son valores que son procesables por una
computadora.
</p>


<p>
Por ejemplo, podemos crear un objeto <b>Gato</b> dentro de nuestra
computadora, si nos fijamos en las cualidades o caracterísiticas del
gato en la vida real como:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Descripcion</th>
<th scope="col" class="org-left">Valor</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Edad del gato</td>
<td class="org-left">16 años</td>
</tr>

<tr>
<td class="org-left">Peso del gato</td>
<td class="org-left">4.3 kg</td>
</tr>

<tr>
<td class="org-left">Nombre del gato</td>
<td class="org-left"><i>Crazy</i></td>
</tr>

<tr>
<td class="org-left">Vivo o muerto?</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">Color del gato</td>
<td class="org-left"><i>Gris</i></td>
</tr>

<tr>
<td class="org-left">Macho o hembra?</td>
<td class="org-left">True</td>
</tr>
</tbody>
</table>


<p>
Podemos definir tantas propiedades como queramos; mientras más
características más preciso será nuestro <i>objeto</i> dentro de la
computadora. Notemos que solo se trata de números y letras, cosas que
se pueden operar.
</p>

<p>
Si queremos generar una imagen de un gato, o un modelo 3D le hacemos
una <i>representación visual</i> al objeto que es hacer un trabajo extra,
pero la información importante está definida por estos valores.
</p>


<p>
La <i>programación orientada a objetos</i> es un <b>paradigma</b> de
programación, una religión, una forma de programar y creer en el
código. No existe el lenguaje supremo, o menos valioso; <span class="underline">todos</span> los
lenguajes contribuyen a solucionar ciertos tipos de problemas de
cierta manera.
</p>

<p>
Para nuestra fortuna, <i>Java</i> es de propósito general
por lo que podemos hacer todo lo que podamos imaginar como dice
<i>Alejandro Taboada</i>; la cuestión está en imaginarlo correctamente y
todo lo demás es apretar teclas!.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-17 Thu 09:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
